{
  "timestamp": "2025-11-24T14:19:35.185333",
  "query": "Edge Al for smart agriculture involves deploying artificial...",
  "papers": [
    {
      "title": "A Review on the Use of Smart Agriculture Systems to Protect Crops",
      "authors": [
        "Gulshan Kumar",
        "Palash M. Gourshettiwar",
        "Saurabh Suman",
        "Shravan Kumar",
        "Dhiraj Kumar",
        "Rahul Raushan"
      ],
      "year": 2025,
      "venue": "2025 International Conference on Electronics and Renewable Systems (ICEARS)",
      "doi": "10.1109/ICEARS64219.2025.10940294",
      "url": "https://www.semanticscholar.org/paper/23cd900882391a1ea7b7a53df2a211b1d33d5231",
      "citation_count": 1,
      "abstract": "Smart agriculture systems leverage the possibilities offered by cutting-edge technologies such as IoT, AI, and remote sensing to revolutionize conventional farming by enhancing resource utilization, production, and crop damage mitigation. Real-time monitoring of soil and crop health, predictive analytics, pest control, and precision irrigation measures are all enabled by these systems. They are able to address major Indian agriculture issues, consequently boosting yield and profitability and promoting environmental sustainability. The largescale deployment of intelligent agriculture systems will change the agriculture landscape in India and will assure long-term food security for an ever-growing population. Challenges include adequate research and future studies in order to better install and achieve smart agricultural systems to protect crops. Intelligent agriculture involves all advanced research, including science and innovations, in national development through space technologies to enhance soil quality, conserve water, and facilitate agriculture information. Space ventures will undergo improved modernization through the introduction of crop sprayers, precision gene editors, epigenetics, big data analytics, IoT, wind and photovoltaic smart energy, AI-enabled robotic applications, and wide-scale desalination technologies. Implementing digital farming systems in developing economies will help their sectors as 85 percent of the global population is set to live in developing countries by 2030. Automation will prove to be necessary since food scarcity is on the rise along with resource wastage. Control strategies such as the IoT, aerial imagery, machine learning, and artificial intelligence will boost production and prevent soil degradation. These advanced technologies are also able to alleviate such issues as plant disease detection, pesticide management, and water application. The introduction of the Internet of Things in the agricultural research world has started with an urge for such communication technologies to communicate and connect devices. The overall assessment of these technologies is, however, vague. This study, therefore, critically analyses 94 papers published on the IoT communication technologies in smart agriculture to highlight the challenges, suggest resolutions, and set recommendations for their application. The need to integrate technology with research was underscored."
    },
    {
      "title": "Modern Trends in the Development of Smart Agriculture Projects",
      "authors": [
        "Hassan Abd El Kareem Gomaa"
      ],
      "year": 2022,
      "venue": "International Journal of Modern Agriculture and Environment",
      "doi": "10.21608/ijmae.2023.214684.1000",
      "url": "https://www.semanticscholar.org/paper/04b481b348cb2992869ceffa08d963315a0f3b1b",
      "citation_count": 3,
      "abstract": ": Smart agriculture projects have become increasingly prominent in recent years, harnessing cutting-edge technologies to revolutionize the agricultural sector. This abstract provides an overview of the modern trends in the development of smart agriculture projects. The advent of Internet of Things (IoT) and sensor technology has played a pivotal role in smart agriculture. Sensors deployed in agricultural settings collect real-time data on parameters like temperature, humidity, and soil moisture. This data is transmitted through IoT networks, enabling remote monitoring and management of farming operations, leading to improved decision-making and resource optimization. Precision agriculture is another significant trend, utilizing technologies such as GPS, drones, and remote sensing. These tools help farmers analyze field variability and deliver inputs precisely, leading to increased efficiency, reduced resource wastage, and enhanced crop yields. Data analytics and artificial intelligence (AI) have emerged as essential components of smart agriculture. Advanced algorithms and AI models process large datasets to derive valuable insights. Predictive analytics and decision support systems assist in weather forecasting, disease detection, and yield estimation, empowering farmers with data-driven recommendations."
    },
    {
      "title": "A Review of Smart Crop Technologies for Resource Constrained Environments: Leveraging Multimodal Data Fusion, Edge-to-Cloud Computing, and IoT Virtualization",
      "authors": [
        "D. Olatinwo",
        "Herman C. Myburgh",
        "Allan De Freitas",
        "Adnan M. Abu-Mahfouz"
      ],
      "year": 2025,
      "venue": "Journal of Sensor and Actuator Networks",
      "doi": "10.3390/jsan14050099",
      "url": "https://www.semanticscholar.org/paper/6049e38039ef98d56505893e54dfc3d719639b52",
      "citation_count": 0,
      "abstract": "Smart crop technologies offer promising solutions for enhancing agricultural productivity and sustainability, particularly in the face of global challenges such as resource scarcity and climate variability. However, their deployment in infrastructure-limited regions, especially across Africa, faces persistent barriers, including unreliable power supply, intermittent internet connectivity, and limited access to technical expertise. This study presents a PRISMA-guided systematic review of literature published between 2015 and 2025, sourced from the Scopus database including indexed content from ScienceDirect and IEEE Xplore. It focuses on key technological components including multimodal sensing, data fusion, IoT resource management, edge-cloud integration, and adaptive network design. The analysis of these references reveals a clear trend of increasing research volume and a major shift in focus from foundational unimodal sensing and cloud computing to more complex solutions involving machine learning post-2019. This review identifies critical gaps in existing research, particularly the lack of integrated frameworks for effective multimodal sensing, data fusion, and real-time decision support in low-resource agricultural contexts. To address this, we categorize multimodal sensing approaches and then provide a structured taxonomy of multimodal data fusion approaches for real-time monitoring and decision support. The review also evaluates the role of IoT virtualization as a pathway to scalable, adaptive sensing systems, and analyzes strategies for overcoming infrastructure constraints. This study contributes a comprehensive overview of smart crop technologies suited to infrastructure-limited agricultural contexts and offers strategic recommendations for deploying resilient smart agriculture solutions under connectivity and power constraints. These findings provide actionable insights for researchers, technologists, and policymakers aiming to develop sustainable and context-aware agricultural innovations in underserved regions."
    },
    {
      "title": "Generative Digital Twins: A Novel Approach in the IoT Edge-Cloud Continuum",
      "authors": [
        "Claudio Savaglio",
        "Vincenzo Barbuto",
        "Fabrizio Mangione",
        "Giancarlo Fortino"
      ],
      "year": 2025,
      "venue": "IEEE Internet of Things Magazine",
      "doi": "10.1109/IOTM.001.2400035",
      "url": "https://www.semanticscholar.org/paper/03cb6ffa84a0e0ff25d2f3db054fe89fef2bf9a8",
      "citation_count": 10,
      "abstract": "Digital Twins (DTs) are software replicas that not only mirrors physical entities but can also proactively predict, control, optimize and simulate their behavior. Born in the manufacturing sector, this concept after an initial hype stayed untouched for decades. The rise of Internet of Things (IoT) and Artificial Intelligence (AI) enabled DT, respectively, to exchange real-world data and to fully exploit it for fulfilling its own goals. Very recently, Gener-ative AI (Gen-AI) methods started being sporadi-cally applied to DT in different contexts and with different targets. After studying the literature, in this article we provide a definition for the Gener-ative DT (GDT) which embraces main distinctive aspects and potential of current and future Gen-Al-aided DTs. In particular, we first disclose the role of Gen-AI in conciliating the model- and the data-driven approach for the development of DTs. Then, we analyze the added value of main Gen-AI architectures for maximizing the performance of DTs operating in the IoT domain and deployed in the edge-cloud continuum. Finally, we illustrate the potential of a GDT in emblematic Smart City scenarios through a use case involving the prediction of vehicles' trajectories when, due to uncontrolled events, only partial information is accessible. The outlined solution conciliates accuracy and explain-ability in the trajectory prediction with overall system robustness and effectiveness."
    },
    {
      "title": "A Hybrid Convolutional Neural Network-Temporal Attention Mechanism Approach for Real-Time Prediction of Soil Moisture and Temperature in Precision Agriculture",
      "authors": [
        "Dr. M.L. Suresh",
        "Swaroopa Rani",
        "Dr. T K Rama",
        "Krishna Rao",
        "Dr. S. Gokilamani",
        "D. Y. A. El-Ebiary",
        "Dr. Prajakta U. Waghe",
        "J. B. Slimane"
      ],
      "year": 2025,
      "venue": "International Journal of Advanced Computer Science and Applications",
      "doi": "10.14569/ijacsa.2025.0160556",
      "url": "https://www.semanticscholar.org/paper/55d187142b27255c9219312440e908be2f72d465",
      "citation_count": 1,
      "abstract": "—Precision Agriculture is a combination of Artificial Intelligence (AI) and the Internet of Things (IoT) to improve farming efficiency, sustainability, and overall productivity. This work presents hybrid CNN-TAM (Convolutional Neural Network–Temporal Attention Mechanism) model running on Edge AI devices for real time crop soil temperature and Soil Moisture prognosis. IoT sensors gather long term environmental data which is preprocessed to remove noise and extract meaningful spatial and temporal features. CNN can obtain spatial patterns and TAM assigns dynamic attention weights to important time steps enhancing prediction accuracy. The proposed hybrid model surpasses the conventional methods like Linear Regression, Random Forest, LSTM, and independent CNN with the lowest RMSE (1.7). Different from cloud-based deployments, the Edge AI deployment offers reduced latency, consumes lower bandwidth, and is better suited for scalability, enabling large-scale, real-time precision farming. Experimental outcome confirms enhanced real-time prediction capability allowing farmers to optimize irrigation schedules, reduce resource waste, and improve crop resilience against extreme weather conditions. This ensures sustainable resource management, conserves water and fertilizers, and enhances decision-making in agriculture. The results demonstrate the capability of AI-driven decision-support tools in present-day agriculture and presents a scalable, cost-effective and deployable solution for both small-and large-scale farms. By emphasizing data privacy, real-time processing, and low-latency inference, this research contributes to the area of precision agriculture relying on AI, addressing key challenges such as real-time analytics, unreliable connectivity, and the need for immediate on-site decision-making. The study develops an AI-powered system for intelligent farm management to support sustainable and Smart Irrigation Optimization is used for efficient agricultural practices."
    },
    {
      "title": "Advancements and Applications of Drone-Integrated Geographic Information System Technology - A Review",
      "authors": [
        "Md. Muzakkir Quamar",
        "Baqer M. Al-Ramadan",
        "K. A. Khan",
        "Md Shafiullah",
        "Sami El-Ferik"
      ],
      "year": 2023,
      "venue": "Remote Sensing",
      "doi": "10.3390/rs15205039",
      "url": "https://www.semanticscholar.org/paper/43683bd04114c1f2307d62a1a6935dcb0d3a0857",
      "citation_count": 83,
      "abstract": "Drones, also known as unmanned aerial vehicles (UAVs), have gained numerous applications due to their low cost, ease of use, vertical takeover and landing, and ability to operate in high-risk or hard-to-reach areas. The contribution of this review is that of building the bridge between drone technology and its application and advancements in the field of Geographic Information System (GIS). The integration of drones and GIS is valuable as it reduces costs and improves accessibility for geospatial data collection. Traditional methods involving aircraft for aerial photography are expensive, requiring the hiring of aircraft, pilots, and photographers. Drones equipped with advanced cameras and artificial intelligence software can replace the conventional technique and at the same time, be economical and time-efficient. The integration of drones and GIS is expected to bring revolutionary benefits in the fields of precision agriculture, urban planning, emergency health response, disaster management, the development of smart cities, food delivery, etc. In this paper, a state-of-the-art review of the deployment of drone-integrated GIS applications in different fields is presented. Numerous techniques and associated challenges related to their development, formulation, implementation, and regulation are highlighted. It has been concluded that drone-integration solutions in GIS improve efficiency and accuracy, enhance the decision-making process, and facilitate better real-time monitoring. The findings of this review paper are intended to help and benefit researchers, business developers, emergency service providers, industrialists, and policymakers."
    },
    {
      "title": "Optimizing Agricultural Data Analysis Techniques through AI-Powered Decision-Making Processes",
      "authors": [
        "E. Elbasi",
        "Nour Mostafa",
        "Chamseddine Zaki",
        "Zakwan Al-Arnaout",
        "A. Topcu",
        "Louai Saker"
      ],
      "year": 2024,
      "venue": "Applied Sciences",
      "doi": "10.3390/app14178018",
      "url": "https://www.semanticscholar.org/paper/4043b20f6c4dea9cba864ad2e4b3fc02b63e3bab",
      "citation_count": 22,
      "abstract": "The agricultural sector is undergoing a transformative paradigm shift with the integration of advanced technologies, particularly artificial intelligence (AI), to enhance data analysis techniques and streamline decision-making processes. This paper delves into the integration of advanced technologies in agriculture, focusing specifically on optimizing data analysis through artificial intelligence (AI) to strengthen decision-making processes in farming. We present a novel AI-powered model that leverages historical agricultural datasets, utilizing a comprehensive array of established machine learning algorithms to enhance the prediction and classification of agricultural data. This work provides tailored algorithm recommendations, bypassing the need to deploy and fine-tune numerous algorithms. We approximate the accuracy of suitable algorithms, highlighting those with the highest precision, thus saving time by leveraging pre-trained AI models on historical agricultural data. Our method involves three phases: collecting diverse agricultural datasets, applying multiple classifiers, and documenting their accuracy. This information is stored in a CSV file, which is then used by AI classifiers to predict the accuracy of new, unseen datasets. By evaluating feature information and various data segmentations, we recommend the configuration that achieves the highest accuracy. This approach eliminates the need for exhaustive algorithm reruns, relying on pre-trained models to estimate outcomes based on dataset characteristics. Our experimentation spans various configurations, including different training–testing splits and feature sets across multiple dataset sizes, meticulously evaluated through key performance metrics such as accuracy, precision, recall, and F-measure. The experimental results underscore the efficiency of our model, with significant improvements in predictive accuracy and resource utilization, demonstrated through comparative performance analysis against traditional methods. This paper highlights the superiority of the proposed model in its ability to systematically determine the most effective algorithm for specific agricultural data types, thus optimizing computational resources and improving the scalability of smart farming solutions. The results reveal that the proposed system can accurately predict a near-optimal machine learning algorithm and data structure for crop data with an accuracy of 89.38%, 87.61%, and 84.27% for decision tree, random forest, and random tree algorithms, respectively."
    },
    {
      "title": "Introduction to the ACSAC’22 Special Issue",
      "authors": [
        "Martina Lindorfer",
        "Gianluca Stringhini"
      ],
      "year": 2024,
      "venue": "DTRAP",
      "doi": "10.1145/3659210",
      "url": "https://www.semanticscholar.org/paper/f87869a47e0e3ec4fa27d85e5681730078932e23",
      "citation_count": 0,
      "abstract": "The Annual Computer Security Applications Conference (ACSAC) brings together cutting-edge researchers, with a broad cross-section of security professionals drawn from academia, industry, and government, gathered to present and discuss the latest security results and topics. ACSAC’s core mission is to investigate practical solutions for computer and network security technology.\n \n The 38th ACSAC was held in Austin, Texas from December 5-9, 2022. As in the previous year, ACSAC especially encouraged contributions on a hard topic theme, in this year in the area of\n Trustworthy Systems\n . Trustworthy systems generally involve the development of capabilities that offer security, safety, and reliability guarantees. ACSAC has always solicited work on applied security; with this hard topic, we put great emphasize on deployable trustworthy systems, including (but not limited to) approaches applied at the intersection of operation systems, formal methods, and programming languages; approaches applied at the architecture level; trustworthy artificial intelligence with emphasize on explainability, correctness, and robustness to attacks; zero-trust solutions that assume no implicit trust, but continually assess risk; and trustworthy systems form a user’s perspective. This topic does not necessarily mean building a complete solution, but identifying key challenges, explaining the deficiencies in state-of-the-art solutions, and demonstrating the effectiveness of the proposed approaches and (potential) impact to the real world.\n \n In addition, ACSAC continues to encourage authors of accepted papers to submit software and data artifacts and make them publicly available to the entire community. Releasing software and data artifacts represents an important step towards facilitating the reproducibility of research results, and ultimately contributes to the real-world deployment of novel security solutions.\n For this special issue we invited authors of papers that appeared at ACSAC 2022 and that successfully passed an evaluation of their software and/or data artifacts to submit an extended version of their papers. This selection criteria ensured that the research has a high potential for being deployed in real-world environments and to be used to implement practical defense systems.\n This volume contains three manuscripts on topics from three different areas: IoT security and privacy, adversarial machine learning, and backdoor attacks against federated learning.\n In “SPACELORD: Private and Secure Smart Space Sharing,” Bae et al. address security and privacy issues of smart devices when installed in shared spaces, such as vacation rentals and co-working meeting rooms. Their approach allows for securely time-sharing by transferring control and the configuration of devices to temporary users, as well as resetting devices and removing any private information when a user leaves a space. The authors extended their original solution with different hardware and software configurations, a discussion of alternative designs, compatibility with existing systems, and design limitations.\n In “Multi-SpacePhish: Extending the Evasion-space of Adversarial Attacks against Phishing Website Detectors using Machine Learning,” Yuan et al. systematically compare adversarial attacks against machine learning systems for the detection of phishing websites. They investigate how realistic different attacks are by performing 12 different attacks and considering different models, feature spaces, and datasets. The authors also formalize and compare evasion-spaces, e.g., perturbations in the problem-space with those in the feature-space. The authors extended their original work with additional experiments and considering more perturbations, as well as the definition and investigation of multi-space attacks considering attackers that introduce perturbations across spaces.\n In “Unveiling the Threat: Investigating Distributed and Centralized Backdoor Attacks in Federated Graph Neural Networks,” Xu et al. investigate two types of backdoor attacks against federated learning, in particular graph neural networks: centralized backdoor attacks and distributed backdoor attacks. The authors evaluate the performance of these attacks in different scenarios, as well as their resilience to two defense mechanisms. The authors extended their original experiments with two new datasets to explore attacks in real-world application scenarios, as well investigate the effectiveness of an additional defense mechanism.\n As Associate Editors for this special issue, we are very pleased that the authors of the above papers have significantly extended and improved their ACSAC’22 publications, and that they provide their artifacts to the public to foster the reproducibility of their research results.\n We wish to thank the authors, reviewers and ACSAC’22 program committee members who have contributed to selecting the papers that appear in this special issue. We would also like to thank the DTRAP Co-Editors in Chief and the ACM for the opportunity to work on this special issue."
    }
  ]
}