{
  "timestamp": "2025-11-24T15:06:36.499801",
  "query": "Edge Processing for Smart Agriculture: Enhancing Rural Crop Monitoring and Management",
  "papers": [
    {
      "title": "Integrating IoT and AI for Precision Agriculture: Enhancing Water Management and Crop Monitoring in Small-Scale Farms",
      "authors": [
        "B. Monchusi",
        "A. Kgopa",
        "Tlhokaboyo Innocentia Mokwana"
      ],
      "year": 2024,
      "venue": "International Conference on Intelligent and Innovative Computing Applications",
      "doi": "10.59200/iconic.2024.017",
      "url": "https://www.semanticscholar.org/paper/1136b4fbb17b0cdc2f1da38f71c5faf1151e3fa5",
      "citation_count": 3,
      "abstract": "Water management is a major issue in agriculture, particularly for small-scale farms that frequently confront resource limits and changing environmental circumstances. Implementing a smart irrigation system using IoT devices has various advantages but also presents some problems. The purpose of the study was to create a smart irrigation system that uses IoT sensors and machine learning algorithms to optimize water usage in small-scale farms, decreasing waste while increasing crop output. The suggested system uses IoT sensors to monitor soil moisture and meteorological conditions, with data processed in real time via edge computing. Machine learning methods, notably Decision Trees and Support Vector Machines (SVMs), are trained to anticipate optimal irrigation schedules using gathered data. The system design incorporates connection infrastructure that enables seamless data transmission and real-time decision-making. Preliminary field studies on a small-scale tomato farm showed a 25% boost in crop output and a 35% reduction in water usage while using the smart irrigation system. The results illustrate the efficacy of merging the Internet of Things and machine learning. The smart irrigation system developed in this study efficiently optimizes water utilization in agriculture, making it a feasible alternative for small-scale farmers confronting water constraint. This study advances the field of precision agriculture by proving the practical use of IoT and machine learning in smart irrigation systems as a main contribution."
    },
    {
      "title": "AgriNexus: A Next-Gen IoT-Driven Autonomous Ecosystem for Smart Agriculture",
      "authors": [
        "Sheela Pitta",
        "G. Amirthayogam",
        "A. S. Rebecca",
        "Krishna Manam",
        "R. Sundar",
        "G. Arunkumar"
      ],
      "year": 2025,
      "venue": "2025 Third International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)",
      "doi": "10.1109/ICAISS61471.2025.11041820",
      "url": "https://www.semanticscholar.org/paper/5d5aa37a6092fc61156d27a5b890722534eb3c91",
      "citation_count": 0,
      "abstract": "In the agriculture sector, various difficulties include resource depletion, workforce deficiencies, and climate change. Outdated IOT assembled resolutions for conservation in powering and observing farming operations, but still impose an enormous amount of human engagement. Now, we familiarize Agri Nexus, a cutting-edge IoT-powered self-sufficient ecosystem that trusts blockchain, edge computing, artificial intelligence, and drone technology. Agri Nexus's energetic resource allocation, modernized farm management, and predictive analytics have made real-time decision-making possible. This technique originates significantly in pesticide routines while augmenting yield proficiency by using drones operational with biosensors for scattered insect control and crop fitness monitoring. By reducing latency and enhancing real-time processing, edge computing succeeds in faster responses to environmental changes. Furthermore, supplies are nontoxic and translucent to blockchain-based smart contracts. On a 50-acre smart farm, our pilot research has shown a 40% reduction in pesticide use, a 25% boost in crop output, and a 30% lessening in water use. The decisions suggest that Agri Nexus meets a transformative approach to workable and independent agriculture, demanding minimal human intervention while exploiting efficiency. Upcoming efforts goals to augment AI models and enlarge blockchain claims for broader scalability. Agri Nexus indicates a significant bound toward self-sustaining, data-driven agricultural ecosystems that elevate efficiency and sustainability."
    },
    {
      "title": "Leveraging Remote Sensing and AI for Smart Crop Monitoring and Management",
      "authors": [
        "Sharmila Sengupta",
        "Richard Joseph"
      ],
      "year": 2025,
      "venue": "Communications on Applied Nonlinear Analysis",
      "doi": "10.52783/cana.v32.3199",
      "url": "https://www.semanticscholar.org/paper/a925b3beb6f8df2b6875ef5bd3a11a5536eb7d1a",
      "citation_count": 0,
      "abstract": "Data-driven, farmer-centric solutions are critical in the dynamic field of agriculture, which is defined by constantly shifting market needs and environmental conditions. In order to transform farming methods through the integration of cutting- edge technologies, this article introduces the comprehensive Crop Planning and Market Information System. The proposed system optimizes crop health by facilitating disease identification and providing customized cures through the use of remote sensing and AI techniques. Moreover, it makes customized crop suggestions that are in line with market trends by utilizing soil analysis and meteorological data. The system provides farmers with up-to-date market information and chances for agricultural stock launches, addressing their vital need to be informed about market conditions. It gives crop planning abilities, utilizing a choice tree set of rules. Farmers can enter their soil parameters, permitting the machine to endorse the most suitable crops for cultivation primarily based on their unique situations. The proposed system also offers disease detection functionality, leveraging Efficient Net B3 for image processing. This function allows farmers to capture photographs of their plants and accurately come across any diseases present. To enhance accessibility, the proposed mobile application features a user-friendly dashboard supporting multiple languages and provides access to agricultural training and educational programs. Ultimately, the system aims to empower farmers, improve crop yields, and drive sustainable agricultural practices in an ever-evolving world."
    },
    {
      "title": "IoT-Based Smart Agriculture System Integration of Sensor Networks with AI for Crop Yield Optimization",
      "authors": [],
      "year": 2025,
      "venue": "Multidisciplinary Journal for Applied Research in Engineering and Technology",
      "doi": "10.54228/m684bg51",
      "url": "https://www.semanticscholar.org/paper/f52f11fe27633457080cc9d9e342f555a9b34de5",
      "citation_count": 0,
      "abstract": "The application of IoT sensor networks based on AI devices in agriculture enables monitoring of the systems and predictive management to determine optimum usage of resources real-time. This paper introduces a smart agriculture system that covers a system that uses a sensor-based monitoring technique, edge computing, and an AI-based crop yield prediction algorithm for improvement of efficient crop production. The system utilizes a process flow at the system level involving data acquisition from the sensors, artificial intelligence decision-making component, and closed feedback loop for high precision farming. Explorations conclude that there is 92% enhancement in the chances of crop yield prediction, 40% enhancement in the use of resources and they also show 35% reduction in operation costs. Integration of edge computing lowers the processing time to 38% hence the ability to attend to crop health complications instantly. These provide an endorsement of IoT & AI integration in the development of efficient and profitable smart farming innovation within a controlled decision-making framework."
    },
    {
      "title": "Farming in the Digital Age: Smart Agriculture with AI and IoT",
      "authors": [
        "Ali Ashoor Issa",
        "Safa Majed",
        "S. Abdul Ameer",
        "Hassan M. Al-Jawahry"
      ],
      "year": 2024,
      "venue": "E3S Web of Conferences",
      "doi": "10.1051/e3sconf/202447700081",
      "url": "https://www.semanticscholar.org/paper/d06261d6ee0e2d2d79da76517c5b67ba34cc881e",
      "citation_count": 9,
      "abstract": "This review article titled “Revolutionizing Agriculture: The Impact of AI and IoT” delves into the transformative role of Artificial Intelligence (AI) and the Internet of Things (IoT) in modern agriculture. It encapsulates the burgeoning wave of digitalization and its implications for data-driven farming practices. The paper comprehensively reviews the advancements in digital agriculture management, highlighting the integration of AI, IoT devices, machine learning, and sensor technology in enhancing farming efficiency and productivity. Emphasis is placed on the use of robotics, drones for crop monitoring, and smart irrigation systems, which leverage real-time data for optimized agricultural operations. The role of high-speed 5G networks in enabling these smart farming solutions is also discussed, particularly their impact on data transmission and connectivity in rural settings. Challenges and opportunities in implementing Smart Decision Support Systems (SDSS) in developing countries are explored, focusing on real-time soil analysis and decision-making aids for farmers. The review further discusses a proposed cloud-based system for remote farm monitoring, employing AI-based models for efficient data processing and improving farming practices. This article aims to provide a nuanced understanding of the current and future potential of AI and IoT in reshaping agricultural practices, addressing global food security challenges, and supporting sustainable development."
    },
    {
      "title": "AI and IoT Integration in Smart Farming: Real-Time Monitoring and Predictive Analytics for Sustainable Agriculture",
      "authors": [
        "Yuvraj G. Nikam",
        "P. V. Shinde",
        "Dhanshri A. Shinde",
        "Sachin M. Kolekar",
        "Rahul P. More",
        "Sandip Nagpure"
      ],
      "year": 2025,
      "venue": "2025 World Skills Conference on Universal Data Analytics and Sciences (WorldSUAS)",
      "doi": "10.1109/WorldSUAS66815.2025.11199045",
      "url": "https://www.semanticscholar.org/paper/48781322c0c8be43a3c83dcf4c0778869d691030",
      "citation_count": 0,
      "abstract": "The intersection of Internet of Things (IoT) and Artificial Intelligence (AI) is a step further towards precision agriculture. The paper discusses a detailed study of how IoT-based sensors, drones, and smart irrigation systems provide real-time monitoring of soil, weather, and crop health. At the same time, AI techniques like machine learning and computer vision provide better utilization of resources, yield prediction, and disease detection in plants. Both IoT and AI enable data-driven decisions, and this enhances the productivity and sustainability of the farm. The paper also proposes technologies like edge computing and blockchain to provide better data processing and traceability. Despite these developments, there are serious issues in the form of high installation cost, lack of internet connectivity in rural areas, and data security concerns. The paper concludes on the future development suggestions like use of 5G, use of edge AI, and proposals for policy initiatives to accelerate smart agriculture techniques."
    },
    {
      "title": "Private 5G Deployment on Smart Agriculture",
      "authors": [
        "Pradyumna Ku Patra",
        "Onur Sahin",
        "Vanlin Sathya",
        "Ashutosh Dutta"
      ],
      "year": 2024,
      "venue": "2024 IEEE Future Networks World Forum (FNWF)",
      "doi": "10.1109/FNWF63303.2024.11028786",
      "url": "https://www.semanticscholar.org/paper/b23f57b3474e54ebd1929a45ada460b8e2e33a64",
      "citation_count": 1,
      "abstract": "This study explores the deployment of Private 5G networks in smart agriculture to enhance productivity and sustainability through the integration of traditional farming with advanced technologies like Internet of Things (IoT), Artifical Intelligence (AI), and big data analytics. These technologies enable precise monitoring and management of agricultural activities, but rural connectivity challenges often hinder their full potential. By implementing Private 5G networks with local edge computing, we achieve reliable, high-speed connectivity in remote areas, processing all data locally at the edge to minimize latency and bandwidth usage. The Mobile Network Operator (MNO) backhaul is used solely for regulatory heartbeat messages to the Spectrum Access System (SAS) under Citizens Broadband Radio Service (CBRS) rules, without relying on cloud services for data processing. Real-world measurements demonstrate that Private 5G offers superior signal quality (reference signal received power and reference signal received quality) and significantly higher throughput, making it a robust solution for optimizing agricultural practices and reducing environmental impact."
    },
    {
      "title": "Smart Infrastructure Systems: A Review of IoT-Enabled Monitoring and Automation in Civil and Agricultural Engineering",
      "authors": [
        "Pranjal Saikia",
        "Bhabashankar Sahu",
        "Gajendra Prasad",
        "Saurabh Kumar",
        "Saksham Suman",
        "Kundan Kumar"
      ],
      "year": 2025,
      "venue": "Asian Journal of Research in Computer Science",
      "doi": "10.9734/ajrcos/2025/v18i4606",
      "url": "https://www.semanticscholar.org/paper/57e7c983de963275028d2f00914c2275f90a3b06",
      "citation_count": 2,
      "abstract": "The Internet of Things (IoT) significantly influences the advancement of smart infrastructure systems in civil and agricultural engineering. IoT technologies have reshaped the management of urban infrastructure and agricultural operations through real-time monitoring, predictive maintenance, and automated control. In civil engineering, IoT sensors help monitor structural integrity, environmental conditions, and urban utilities, enhancing safety and efficiency in areas like traffic and waste management. IoT enhances agriculture through precision farming methods, including automatic irrigation, monitoring of crop and soil health, and resource optimization, leading to sustainable practices and increasing yields. This study analyzes IoT applications in rural and remote areas, focusing on the integration and challenges of IoT deployment. This also employs a case study approach to analyze IoT applications, highlighting key technological, economic, and policy challenges in remote and rural regions where connectivity and integration are critical. The findings suggest that IoT-driven infrastructure improves efficiency, sustainability, and resilience, but require more comprehensive analysis and integration in remote and rural areas. Future possibilities for IoT are discussed, focusing on advancements in edge computing, the use of renewable energy, and the development of smart rural infrastructure that meets both urban and agricultural needs. The paper urges for ongoing research and supportive policies that optimize the potential of IoT-integrated infrastructure systems, which are expected to improve efficiency, sustainability, and resilience in both sectors."
    },
    {
      "title": "Ontology-Based Smart Irrigation System: Enhancing Agricultural Water Management",
      "authors": [
        "Maher u Nisa",
        "Muhammad Azam",
        "Tanveer Rafiq",
        "Mohsin Sattar",
        "Aiman Zahra",
        "Sana Zafar"
      ],
      "year": 2024,
      "venue": "The Asian Bulletin of Big Data Management",
      "doi": "10.62019/abbdm.v4i1.131",
      "url": "https://www.semanticscholar.org/paper/219b3e95cec21cbbe8aea4fb5f0f226d7ee0368d",
      "citation_count": 0,
      "abstract": "An Ontology-Based Smart Irrigation System is presented in this research with the goal of improving agricultural water management. The main issue discussed is the inefficiency of conventional irrigation techniques, which results in water waste and lower crop yields. The process used entails creating an ontology, which includes defining concepts, establishing relationships, identifying domains, and populating the ontology. In order to facilitate real-time monitoring and decision-making, the irrigation system also incorporates sensors, actuators, and data processing algorithms. The main conclusions show that the ontology-based approach boosts crop output, encourages sustainable farming practices, and enhances water consumption efficiency. The findings of this study imply that ontology-based smart irrigation systems present a viable way to deal with the problems associated with water scarcity, improve agricultural output, and reduce their negative effects on the environment. The research adds to the expanding corpus of information on intelligent irrigation systems and emphasizes the significance of implementing cutting-edge technologies for agriculture's sustainable water management."
    }
  ]
}